import string

ABOUT_MSG = 'memory tools version 1.1.0'

ABOUT_TEXT = '''
软件功能:
1.复制翻译。会将你剪切板里的英文翻译成中文，并以弹出框显示翻译后的文本。
2.OCR识别。对剪贴板里面的图片进行OCR识别，可以用任意软件截图。
3.休息提醒。在你工作一段时间以后，提醒你该休息了。时间默认90分钟，可以自己更改。

软件说明：
1.复制翻译使用谷歌翻译的接口。
2.如果复制的文本与目标语言一致，则不会翻译，如果翻译后的结果与未翻译一样，则不会显示。
3.默认使用语言自动检测，如果开启严格模式，则将设置源语言。（可以在谷歌翻译上试一下，在中英文混排时可能有一点差异）
4.OCR使用百度AI开放平台的接口，需要设置以后才能使用。

关于作者：
1.作者：Memory
2.邮箱：memory_d@foxmail.com
'''

HOVER_TEXT = "Memory Tools"

ALERT_MSG = 'tip: 连续在电脑前工作太久容易脱发，得颈椎病，猝死。'

CONFIG = 'config.json'
LANGUAGE = 'language.json'

DEFAULT_CONFIG = { 
	'ocr' :
		{ 
			'APP_ID' : '', 
			'API_KEY' : '', 
			'SECRET_KEY' : ''
		},
	'copytrans':
		{
			'src' : 'en',
			'dest' : 'zh-cn'
		}
}

LANGUAGE = {    '自动检测':'', '中文':'zh-cn','中文繁体':'zh-tw', '英语':'en',  '德语':'de', '俄语':'ru' ,'法语':'fr',
				'阿尔巴尼亚语':'sq','阿拉伯语':'ar', '阿姆哈拉语':'am', '阿塞拜疆语':'az', '爱尔兰语':'ga',
                '爱沙尼亚语':'et' ,'巴斯克语':'eu' ,'白俄罗斯语':'be',
                '保加利亚语':'bg', '冰岛语':'is', '波兰语':'pl', '波斯尼亚语':'bs',
                '波斯语':'fa', '布尔语':'af', '丹麦语':'da',
                '菲律宾语':'tl', '芬兰语':'fi', '弗里西语':'fy' ,'高棉语':'km', '格鲁吉亚语':'ka',
                '古吉拉特语':'gu', '哈萨克语':'kk', '海地克里奥尔语':'ht',
                '豪萨语':'ha', '荷兰语':'nl' ,'吉尔吉斯语':'ky', '加利西亚语':'gl', '加泰罗尼亚语':'ca',
                '捷克语':'cs', '卡纳达语':'kn', '科西嘉语':'co', '克罗地亚语':'hr',
                '库尔德语':'ku', '拉丁语':'la', '拉脱维亚语':'lv', '老挝语':'lo', '立陶宛语':'lt',
                '卢森堡语':'lb', '罗马尼亚语':'ro', '马尔加什语':'mg', '马耳他语':'mt',
                '马拉地语':'mr', '马拉雅拉姆语':'mf', '马来语':'ms', '马其顿语':'mk',
                '毛利语':'mi', '蒙古语':'mn','孟加拉语':'bn', '缅甸语':'my', '苗语':'hmn', '南非克萨语':'xh', '南非祖鲁语':'zu',
                '尼泊尔语':'ne', '挪威语':'no', '旁遮普语' :'pa','葡萄牙语':'pt' ,'普什图语':'ps',
                '齐切瓦语':'ny', '日语':'ja', '瑞典语':'sv', '萨摩亚语' :'sm','塞尔维亚语':'sr',
                '赛所托语':'st','僧伽罗语':'si', '世界语':'eo', '斯洛伐克语':'sk', '斯洛文尼亚语':'sl',
                '斯瓦希里语':'sw', '苏格兰盖尔语':'gd', '宿务语':'ceb', '索马里语':'so', '塔吉克语':'tg', '泰卢固语':'te',
                '泰米尔语':'ta', '泰语':'th', '土耳其语':'tr', '威尔士语':'cy', '乌尔都语':'ur',
                '乌克兰语':'uk', '乌兹别克语':'uz', '西班牙语':'es', '希伯来语':'rw', '希腊语':'el',
                '夏威夷语':'haw', '信德语':'sd', '匈牙利语':'hu', '修纳语':'sn',
                '亚美尼亚语':'hy', '伊博语':'ig', '意大利语':'it', '意第绪语':'yi', '印地语':'hi',
                '印尼巽他':'su',  '印尼语':'id', '印尼爪哇语':'jw', '约鲁巴语':'yo', '越南语':'vi'
            }

REMOVE_PUNCTUATION_MAP = dict((ord(char), None) for char in string.punctuation)
NOTAS = u'[’·°–!"#$%&\'()*+,-./:;<=>?@，。?★、…【】（）《》？“”‘’！[\\]^_`{|}~]+'

XUEERSI_KEYS = [
    {
        'app_key': '5aa0ae48e4b03fe034cb547f9ebfa47190d88739',
        'spp_secret': '96bc4d214831921740fcc383681460f4a60558992ac1c20cba85da49f2fb408f'
    },
    {
        'app_key': 'cde7ff598c932b589b80d8b8c84aee88f563ff93',
        'app_secret': '3aeb7acbe8b5f3118da2bf59db42d0cbbf4237453fd3f03bee721c52a02eafcc'
    }
]